#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.rds.data.aws_availability_zones.available: Reading...
module.eks.data.aws_iam_policy_document.carguero-technical-challenge-assume-role: Reading...
module.eks.aws_iam_role.carguero-technical-challenge-node-role: Refreshing state... [id=carguero-technical-challenge-node-role]
module.rds.aws_vpc.carguero-technical-challenger-db-vpc: Refreshing state... [id=vpc-0f5ebe29ad6533321]
module.eks.aws_vpc.carguero-technical-challenger-vpc: Refreshing state... [id=vpc-0e8856d5717fbf58b]
module.eks.data.aws_iam_policy_document.carguero-technical-challenge-assume-role: Read complete after 0s [id=3552664922]
module.eks.data.aws_availability_zones.available: Reading...
module.eks.aws_iam_role.carguero-technical-challenge-iam-role: Refreshing state... [id=carguero-technical-challenge-role]
module.rds.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.eks.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-cluster-policy: Refreshing state... [id=carguero-technical-challenge-role-20230618230506529200000004]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-service-policy: Refreshing state... [id=carguero-technical-challenge-role-20230618230506556900000005]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-node-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230618230506492700000002]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-registry-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230618230506488500000001]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-cni-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230618230506522100000003]
module.rds.aws_internet_gateway.carguero-technical-challenger-db-ig: Refreshing state... [id=igw-0a103f683858d278f]
module.rds.aws_subnet.carguero-technical-challenger-db-subnet[0]: Refreshing state... [id=subnet-073b8d2f78446906b]
module.rds.aws_subnet.carguero-technical-challenger-db-subnet[1]: Refreshing state... [id=subnet-0f777c58cf88d761e]
module.rds.aws_security_group.carguero-technical-challenge-db-sg: Refreshing state... [id=sg-03ec0cd54d7729830]
module.eks.aws_security_group.carguero-technical-challenge-db-sg: Refreshing state... [id=sg-06e1de82fbecb0abc]
module.eks.aws_internet_gateway.carguero-technical-challenger-ig: Refreshing state... [id=igw-013916cb64494d713]
module.eks.aws_subnet.carguero-technical-challenger-subnet[1]: Refreshing state... [id=subnet-029f7804348303b71]
module.eks.aws_subnet.carguero-technical-challenger-subnet[0]: Refreshing state... [id=subnet-0150929ea866ddf53]
module.rds.aws_route_table.carguero-technical-challenger-db-rt: Refreshing state... [id=rtb-0018cc55739d82717]
module.rds.aws_db_subnet_group.carguero-technical-challenge-db-subnet-group: Refreshing state... [id=carguero-technical-challenge-db-subnet-group]
module.eks.aws_route_table.carguero-technical-challenger-rt: Refreshing state... [id=rtb-005d7ca7ed3f7cd05]
module.eks.aws_eks_cluster.carguero-technical-challenge: Refreshing state... [id=carguero-technical-challenge-cluster]
module.rds.aws_route_table_association.carguero-technical-challenger-rt-assoc[0]: Refreshing state... [id=rtbassoc-04308652869acc250]
module.rds.aws_route_table_association.carguero-technical-challenger-rt-assoc[1]: Refreshing state... [id=rtbassoc-0fa260a94dbd6848f]
module.eks.aws_route_table_association.carguero-technical-challenger-rt-assoc[1]: Refreshing state... [id=rtbassoc-0cce6e38f44a77697]
module.eks.aws_route_table_association.carguero-technical-challenger-rt-assoc[0]: Refreshing state... [id=rtbassoc-0afe8d822d4172369]
module.rds.aws_db_instance.carguero-technical-challenge-db: Refreshing state... [id=db-DMLPOKWUYPKMJEQDPLIIF7RT4Y]
module.eks.aws_eks_node_group.carguero-technical-challenge-node-group[1]: Refreshing state... [id=carguero-technical-challenge-cluster:carguero-technical-challenge-node-2]
module.eks.aws_eks_node_group.carguero-technical-challenge-node-group[0]: Refreshing state... [id=carguero-technical-challenge-cluster:carguero-technical-challenge-node-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.helm_release.nginx-ingress-controller will be created
  + resource "helm_release" "nginx-ingress-controller" {
      + atomic                     = false
      + chart                      = "nginx-ingress-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress-controller"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.7.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "service.type"
          + value = "LoadBalancer"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marciojpacheco, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform plan`*